spec/cassettes/StripeWrapper/StripeWrapper_Customer/with_valid_credit_card/creates_a_customer_with_valid_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4242424242424242&card[exp_month]=8&card[exp_year]=2016&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - Bearer sk_test_4WDjoqxy0rAd0OROX0x5MnUD
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Tsubasa-iMac.local 13.3.0 Darwin Kernel Version 13.3.0: Tue Jun  3 21:27:35
        PDT 2014; root:xnu-2422.110.17~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 13 Aug 2014 23:53:40 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '596'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-07-26'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_14RBYm4wLG6Oy3vF27sFwylD",
          "livemode": false,
          "created": 1407974020,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_14RBYm4wLG6Oy3vFmrjjRGAA",
            "object": "card",
            "last4": "4242",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 8,
            "exp_year": 2016,
            "fingerprint": "QgWwqM7FVfqMQcru",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "customer": null
          }
        }
    http_version: 
  recorded_at: Wed, 13 Aug 2014 23:53:40 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: card=tok_14RBYm4wLG6Oy3vF27sFwylD&plan=base&email=randy_davis%40halvorsonmclaughlin.name
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.14.0
      Authorization:
      - Bearer sk_test_4WDjoqxy0rAd0OROX0x5MnUD
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.14.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin13.0","publisher":"stripe","uname":"Darwin
        Tsubasa-iMac.local 13.3.0 Darwin Kernel Version 13.3.0: Tue Jun  3 21:27:35
        PDT 2014; root:xnu-2422.110.17~1/RELEASE_X86_64 x86_64"}'
      Content-Length:
      - '88'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 13 Aug 2014 23:53:40 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '2235'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Stripe-Version:
      - '2014-07-26'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1407974020,
          "id": "cus_4aMHkTP4xQpVw9",
          "livemode": false,
          "description": null,
          "email": "randy_davis@halvorsonmclaughlin.name",
          "delinquent": false,
          "metadata": {},
          "subscriptions": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4aMHkTP4xQpVw9/subscriptions",
            "data": [
              {
                "id": "sub_4aMHfqPGA2Okj6",
                "plan": {
                  "interval": "month",
                  "name": "myflix base plan",
                  "created": 1407887219,
                  "amount": 999,
                  "currency": "usd",
                  "id": "base",
                  "object": "plan",
                  "livemode": false,
                  "interval_count": 1,
                  "trial_period_days": null,
                  "metadata": {},
                  "statement_description": null
                },
                "object": "subscription",
                "start": 1407974020,
                "status": "active",
                "customer": "cus_4aMHkTP4xQpVw9",
                "cancel_at_period_end": false,
                "current_period_start": 1407974020,
                "current_period_end": 1410652420,
                "ended_at": null,
                "trial_start": null,
                "trial_end": null,
                "canceled_at": null,
                "quantity": 1,
                "application_fee_percent": null,
                "discount": null,
                "metadata": {}
              }
            ]
          },
          "discount": null,
          "account_balance": 0,
          "currency": "usd",
          "cards": {
            "object": "list",
            "total_count": 1,
            "has_more": false,
            "url": "/v1/customers/cus_4aMHkTP4xQpVw9/cards",
            "data": [
              {
                "id": "card_14RBYm4wLG6Oy3vFmrjjRGAA",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 8,
                "exp_year": 2016,
                "fingerprint": "QgWwqM7FVfqMQcru",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null,
                "customer": "cus_4aMHkTP4xQpVw9"
              }
            ]
          },
          "default_card": "card_14RBYm4wLG6Oy3vFmrjjRGAA"
        }
    http_version: 
  recorded_at: Wed, 13 Aug 2014 23:53:40 GMT
recorded_with: VCR 2.9.2
